* Encoder

#+begin_src python :session :tangle yes :results output
latent_dim = 2

encoder_inputs = keras.Input(shape=(128, 16))
x = layers.Conv1D(16, 3, activation="relu", padding="causal")(encoder_inputs)
x = layers.Flatten()(x)
z_mean = layers.Dense(latent_dim, name="z_mean")(x)
z_log_var = layers.Dense(latent_dim, name="z_log_var")(x)
z = Sampling()([z_mean, z_log_var])
encoder = keras.Model(encoder_inputs, [z_mean, z_log_var, z], name="encoder")
encoder.summary()
#+end_src

#+RESULTS:
#+begin_example
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_22 (InputLayer)           [(None, 128, 16)]    0                                            
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 128, 16)      784         input_22[0][0]                   
__________________________________________________________________________________________________
flatten_10 (Flatten)            (None, 2048)         0           conv1d_14[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 2)            4098        flatten_10[0][0]                 
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 2)            4098        flatten_10[0][0]                 
__________________________________________________________________________________________________
sampling_9 (Sampling)           (None, 2)            0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,980
Trainable params: 8,980
Non-trainable params: 0
__________________________________________________________________________________________________
#+end_example

* Decoder

#+begin_src python :session :tangle yes :results output
latent_inputs = keras.Input(shape=(latent_dim,))
x = layers.Dense(2048, activation="relu")(latent_inputs)
x = layers.Reshape((128, 16))(x)
decoder_outputs = layers.Conv1DTranspose(16, 3, activation="sigmoid", padding="same")(x)
decoder = keras.Model(latent_inputs, decoder_outputs, name="decoder")
decoder.summary()
#+end_src

#+RESULTS:
#+begin_example
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_25 (InputLayer)        [(None, 2)]               0         
_________________________________________________________________
dense_19 (Dense)             (None, 2048)              6144      
_________________________________________________________________
reshape_13 (Reshape)         (None, 128, 16)           0         
_________________________________________________________________
conv1d_transpose_9 (Conv1DTr (None, 128, 16)           784       
=================================================================
Total params: 6,928
Trainable params: 6,928
Non-trainable params: 0
_________________________________________________________________
#+end_example

* Training

#+begin_src python :session :tangle yes :results output
vae = VAE(encoder, decoder)
csv_logger = keras.callbacks.CSVLogger('training.log')
vae.compile(loss = None, optimizer=keras.optimizers.Adam(learning_rate = 0.0001))
vae.fit(dataset_train, epochs=20, batch_size = 64, callbacks = [csv_logger], validation_data = (dataset_train, dataset_train))

encoder.save("encoder_v1.pb")
decoder.save("decoder_v1.pb")
#+end_src

#+RESULTS:
: Epoch 1/1000

